---
kind: type
id: T:Autodesk.Revit.DB.LinkedFileStatus
source: html/410b48f8-2a32-3d54-492c-c9a9fe4030ca.htm
---
# Autodesk.Revit.DB.LinkedFileStatus

Enum displaying the loaded status of a linked file

## Syntax (C#)
```csharp
public enum LinkedFileStatus
```